Authpuppy/app/controllers/access_nodes_controller.rb

  def index
    @access_nodes = AccessNode.paginate(page: params[:page]);
---
SELECT COUNT(*) FROM `access_nodes`
SELECT `access_nodes`.* FROM `access_nodes` ORDER BY updated_at DESC LIMIT 30 OFFSET 0

  def edit
    @access = AccessNode.find(params[:id])
    @auth =@access.auth ||= Auth.first
---
SELECT `access_nodes`.* FROM `access_nodes` WHERE `access_nodes`.`id` = 62 ORDER BY updated_at DESC LIMIT 1
SELECT `auths`.* FROM `auths` WHERE `auths`.`access_node_id` = 62 LIMIT 1

  def init
    @access = AccessNode.find(params[:id])
    @config =@access.conf ||= Conf.first
---
SELECT `access_nodes`.* FROM `access_nodes` WHERE `access_nodes`.`id` = 10 ORDER BY updated_at DESC LIMIT 1
SELECT `confs`.* FROM `confs` WHERE `confs`.`access_node_id` = 10 LIMIT 1

  def firewall
    @access = AccessNode.find(params[:id])
---
SELECT `access_nodes`.* FROM `access_nodes` WHERE `access_nodes`.`id` = 68 ORDER BY updated_at DESC LIMIT 1

  def show
    page = params[:page] || 1
    timeframe = params[:time] || Time.now - 1.month
    @access = AccessNode.find(params[:id])
    @connections = @access.connections.list_by_date(page, timeframe, @access_node)
    @online_num = @access.show_online()
    @daily_num = @connections.unique_by_date(Time.now.to_date).length
---
SELECT `access_nodes`.* FROM `access_nodes` WHERE `access_nodes`.`id` = 74 ORDER BY updated_at DESC LIMIT 1
SELECT COUNT(*) FROM `connections` WHERE `connections`.`access_node_id` = 74 AND (used_on is not null and (expired_on is null or expired_on > NOW()))
SELECT `connections`.* FROM `connections` WHERE `connections`.`access_node_id` = 74 AND (used_on > '2014-06-03 09:21:57') AND (used_on > '2014-07-03') ORDER BY updated_at DESC, used_on desc LIMIT 10 OFFSET 0

  def setconfig
    @access = AccessNode.find(params[:id])
    puts params[:nodecmd_id]
    @access.update_attributes(:nodecmd_id=>params[:nodecmd_id],:cmdflag =>true )
---
SELECT `access_nodes`.* FROM `access_nodes` WHERE `access_nodes`.`id` = 74 ORDER BY updated_at DESC LIMIT 1
UPDATE `access_nodes` SET `nodecmd_id` = 1, `updated_at` = '2014-07-03 09:21:59' WHERE `access_nodes`.`id` = 74

  def AP_status
      if params[:gw_id].nil?
         back_json(4002003,"Paramters is error")
         return
      end
      mac=params[:gw_id].gsub(/[:-]/, "").upcase
      node = AccessNode.find(:first, :conditions => ["mac = ?", mac])
---
SELECT `access_nodes`.* FROM `access_nodes` WHERE (mac = '1111') ORDER BY updated_at DESC LIMIT 1