Authpuppy/app/controllers/firewall_controller.rb

SELECT `access_nodes`.* FROM `access_nodes` WHERE (mac = 'E104E2C48F19') ORDER BY updated_at DESC LIMIT 1
SELECT `trusted_macs`.* FROM `trusted_macs` WHERE (mac = '68:96:7b:d7:7d:a2' and access_node_id = 68) LIMIT 1
INSERT INTO `trusted_macs` (`access_node_id`, `created_at`, `mac`, `updated_at`) VALUES (68, '2014-07-04 10:51:25', '68:96:7b:d7:7d:a2', '2014-07-04 10:51:25')
---
  def add_mac_white
      if params[:gw_id].nil?
         back_json(400101,"Parameter:gw_id is missing")
         return
      end
      if params[:mac].nil?
         back_json(400101,"Parameter:mac is missing")
         return
      end
      if !(params[:mac]=~/^[0-9a-z]{2}:[0-9a-z]{2}:[0-9a-z]{2}:[0-9a-z]{2}:[0-9a-z]{2}:[0-9a-z]{2}$/)
         back_json(400101,"mac is error")
         return
      end
      node = AccessNode.find_by_mac(params[:gw_id])
      if node.nil?
         back_json(400101,"AP is not existing")
         return
      end
      tmac=TrustedMac.find(:first, :conditions => ["mac = ? and access_node_id = ?", params[:mac],node.id])
      if tmac
         back_json(400101,"mac is existing in whitelists")
         return
      end
      TrustedMac.create!(mac:params[:mac],access_node_id:node.id)

SELECT `access_nodes`.* FROM `access_nodes` WHERE (mac = 'E104E2C48F19') ORDER BY updated_at DESC LIMIT 1
SELECT `trusted_macs`.* FROM `trusted_macs` WHERE (mac = '68:96:7b:d7:7d:a2' and access_node_id = 68) LIMIT 1
DELETE FROM `trusted_macs` WHERE `trusted_macs`.`id` = 50
---
  def del_mac_white
      if params[:gw_id].nil?
         back_json(400101,"Parameter:gw_id is missing")
         return
      end
      if params[:mac].nil?
         back_json(400101,"Parameter:mac is missing")
         return
      end
      node = AccessNode.find_by_mac(params[:gw_id])
      if node.nil?
         back_json(400101,"AP is not existing")
         return
      end
      tmac=TrustedMac.find(:first, :conditions => ["mac = ? and access_node_id = ?", params[:mac],node.id])
      if tmac.nil?
         back_json(400101,"mac is not existing in whitelists")
         return
      end
      tmac.delete

SELECT `access_nodes`.* FROM `access_nodes` WHERE (mac = 'E104E2C48F19') ORDER BY updated_at DESC LIMIT 1
SELECT `black_macs`.* FROM `black_macs` WHERE (mac = '68:96:7b:d7:7d:a2' and access_node_id = 68) LIMIT 1
INSERT INTO `black_macs` (`access_node_id`, `created_at`, `mac`, `updated_at`) VALUES (68, '2014-07-04 11:13:41', '68:96:7b:d7:7d:a2', '2014-07-04 11:13:41')
---
  def add_mac_black
      if params[:gw_id].nil?
         back_json(400101,"Parameter:gw_id is missing")
         return
      end
      if params[:mac].nil?
         back_json(400101,"Parameter:mac is missing")
         return
      end
      if !(params[:mac]=~/^[0-9a-z]{2}:[0-9a-z]{2}:[0-9a-z]{2}:[0-9a-z]{2}:[0-9a-z]{2}:[0-9a-z]{2}$/)
         back_json(400101,"mac is error")
         return
      end
      node = AccessNode.find_by_mac(params[:gw_id])
      if node.nil?
         back_json(400101,"AP is not existing")
         return
      end
      bmac=BlackMac.find(:first, :conditions => ["mac = ? and access_node_id = ?", params[:mac],node.id])
      if bmac
         back_json(400101,"mac is existing in blacklists")
         return
      end
      BlackMac.create!(mac:params[:mac],access_node_id:node.id)

SELECT `access_nodes`.* FROM `access_nodes` WHERE (mac = 'E104E2C48F19') ORDER BY updated_at DESC LIMIT 1
SELECT `black_macs`.* FROM `black_macs` WHERE (mac = '68:96:7b:d7:7d:a2' and access_node_id = 68) LIMIT 1
DELETE FROM `black_macs` WHERE `black_macs`.`id` = 17
---
  def del_mac_black
      if params[:gw_id].nil?
         back_json(400101,"Parameter:gw_id is missing")
         return
      end
      if params[:mac].nil?
         back_json(400101,"Parameter:mac is missing")
         return
      end
      node = AccessNode.find_by_mac(params[:gw_id])
      if node.nil?
         back_json(400101,"AP is not existing")
         return
      end
      bmac=BlackMac.find(:first, :conditions => ["mac = ? and access_node_id = ?", params[:mac],node.id])
      if bmac.nil?
         back_json(400101,"mac is not existing in blacklists")
         return
      end
      bmac.delete

SELECT `access_nodes`.* FROM `access_nodes` WHERE (mac = 'E104E2C48F19') ORDER BY updated_at DESC LIMIT 1
SELECT `public_ips`.* FROM `public_ips` WHERE (publicip = '219.141.189.61' and access_node_id = 68) LIMIT 1
INSERT INTO `public_ips` (`access_node_id`, `created_at`, `publicip`, `updated_at`) VALUES (68, '2014-07-04 11:30:30', '219.141.189.61', '2014-07-04 11:30:30')
---
  def add_ip_white
      if params[:gw_id].nil?
         back_json(400101,"Parameter:gw_id is missing")
         return
      end
      if params[:ip].nil?
         back_json(400101,"Parameter:ip is missing")
         return
      end
      if !(params[:ip]=~/^\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3}$/)
         back_json(400101,"ip is error")
         return
      end
      node = AccessNode.find_by_mac(params[:gw_id])
      if node.nil?
         back_json(400101,"AP is not existing")
         return
      end
      bip=PublicIp.find(:first, :conditions => ["publicip = ? and access_node_id = ?", params[:ip],node.id])
      if bip
         back_json(400101,"ip is  existing in whitelists")
         return
      end
      PublicIp.create!(publicip:params[:ip],access_node_id:node.id)

SELECT `access_nodes`.* FROM `access_nodes` WHERE (mac = 'E104E2C48F19') ORDER BY updated_at DESC LIMIT 1
SELECT `public_ips`.* FROM `public_ips` WHERE (publicip = '219.141.189.61' and access_node_id = 68) LIMIT 1
DELETE FROM `public_ips` WHERE `public_ips`.`id` = 41
---
  def del_ip_white
      if params[:gw_id].nil?
         back_json(400101,"Parameter:gw_id is missing")
         return
      end
      if params[:ip].nil?
         back_json(400101,"Parameter:ip is missing")
         return
      end
      node = AccessNode.find_by_mac(params[:gw_id])
      if node.nil?
         back_json(400101,"AP is not existing")
         return
      end
      wip=PublicIp.find(:first, :conditions => ["publicip = ? and access_node_id = ?", params[:ip],node.id])
      if wip.nil?
         back_json(400101,"ip is not existing in whitelists")
         return
      end
      wip.delete

SELECT `access_nodes`.* FROM `access_nodes` WHERE `access_nodes`.`id` = 68 ORDER BY updated_at DESC LIMIT 1
SELECT COUNT(*) FROM `public_ips` WHERE `public_ips`.`access_node_id` = 68
INSERT INTO `public_ips` (`access_node_id`, `created_at`, `publicip`, `updated_at`) VALUES (68, '2014-07-04 11:26:54', '219.141.189.61', '2014-07-04 11:26:54')
UPDATE `access_nodes` SET `configflag` = 1, `updated_at` = '2014-07-04 11:26:54' WHERE `access_nodes`.`id` = 68
---
  def ip_add
    if params[:id].nil? and params[:ip].nil?
      redirect_to "/404"
      return;
    end

    @access = AccessNode.find(params[:id])
    if @access.nil?
      redirect_to "/404"
      return;
    end

    if @access.public_ips.count >= 5
      @err = "IP地址白名单已满"
    else
      begin
        @ip = PublicIp.create!(publicip:params[:ip],access_node_id:params[:id]);
      rescue Exception => e
        @err = "添加失败,请检查IP地址格式"
      end
    end

    if !@err.nil?
      respond_to do |format|
        format.html { render :text=>"Success to create mac address" }
        format.js { render :action=>"addipfail", :layout=>false }
      end
   else
     @access.update_attributes( :configflag => true );

DELETE FROM `public_ips` WHERE `public_ips`.`id` = 40
SELECT `public_ips`.* FROM `public_ips` WHERE `public_ips`.`id` = 40 LIMIT 1
---
  def ip_del
    if params[:id].nil?
      redirect_to "/404"
      return;
    end

    PublicIp.find(params[:id]).delete