Authpuppy/app/controllers/user_controller.rb

SELECT `connections`.* FROM `connections` WHERE (token = NULL) ORDER BY updated_at DESC LIMIT 1
---
  def client_status
      if params[:client_id].nil?
         status_json(4002003,"Paramters client_id is error")
         return
      end
      conn = Connection.find(:first, :conditions => ['token = ?', params[:client_id]])